app/Controllers/TransaksiController.php

INSERT INTO `transaction` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_at`, `updated_at`) VALUES ('erahayu', '10908000', 'Semarang, Jawa Tengah', '9000', 0, '2025-07-04 03:21:14', '2025-07-04 03:21:14')
INSERT INTO `transaction_detail` (`transaction_id`, `product_id`, `jumlah`, `diskon`, `subtotal_harga`, `created_at`, `updated_at`) VALUES (1, '1', 1, 0, 10899000, '2025-07-04 03:21:15', '2025-07-04 03:21:15')
---
public function buy()
{
    if ($this->request->getPost()) {
        $dataForm = [
            'username' => $this->request->getPost('username'),
            'total_harga' => $this->request->getPost('total_harga'),
            'alamat' => $this->request->getPost('alamat'),
            'ongkir' => $this->request->getPost('ongkir'),
            'status' => 0,
            'created_at' => date("Y-m-d H:i:s"),
            'updated_at' => date("Y-m-d H:i:s")
        ];

        $this->transaction->insert($dataForm);

        $last_insert_id = $this->transaction->getInsertID();

        foreach ($this->cart->contents() as $value) {
            $dataFormDetail = [
                'transaction_id' => $last_insert_id,
                'product_id' => $value['id'],
                'jumlah' => $value['qty'],
                'diskon' => 0,
                'subtotal_harga' => $value['qty'] * $value['price'],
                'created_at' => date("Y-m-d H:i:s"),
                'updated_at' => date("Y-m-d H:i:s")
            ];

            $this->transaction_detail->insert($dataFormDetail);